[
  {
    "service": "Amazon A2I",
    "shortDescription": "Easily implement human review of ML predictions",
    "url": "https://docs.aws.amazon.com/augmented-ai",
    "categories": ["Machine Learning"],
    "detailDescription": "Amazon Augmented AI (Amazon A2I) enables you to build the workflows required for human review of ML predictions. Amazon A2I brings human review to all developers, removing the undifferentiated heavy lifting associated with building human review systems or managing large numbers of human reviewers.",
    "sections": [
      {
        "name": "Developer Guide",
        "items": [
          {
            "name": "Developer Guide",
            "link": "https://docs.aws.amazon.com/sagemaker/latest/dg/use-augmented-ai-a2i-human-review-loops.html?icmpid=docs_a2i_lp",
            "description": "Provides a conceptual overview of Amazon A2I. Offers step-by-step instructions for using AI applications such as Amazon Rekognition, Amazon Textract, or your custom machine learning (ML) models to create workflows required for human review of ML predictions."
          }
        ]
      },
      {
        "name": "API Reference",
        "items": [
          {
            "name": "Amazon A2I Runtime Model",
            "link": "/augmented-ai/2019-11-07/APIReference/Welcome.html?icmpid=docs_a2i_lp/index.html",
            "description": "This API reference includes information about API actions and data types that you can use to interact with Amazon A2I programmatically."
          }
        ]
      },
      {
        "name": "Tutorials and Samples",
        "items": [
          {
            "name": "Using Amazon A2I with Amazon Textract",
            "link": "https://docs.aws.amazon.com/textract/latest/dg/a2i-textract.html?icmpid=docs_a2i_lp",
            "description": "Provides step-by-step instructions for using Amazon A2I with Amazon Textract."
          },
          {
            "name": "Reviewing Unsafe Content with Amazon A2I Using Amazon Rekognition",
            "link": "https://docs.aws.amazon.com/rekognition/latest/dg/a2i-rekognition.html?icmpid=docs_a2i_lp",
            "description": "Provides step-by-step instructions for using Amazon A2I with Amazon Rekognition."
          },
          {
            "name": "Crowd HTML Elements Reference",
            "link": "https://docs.aws.amazon.com/sagemaker/latest/dg/sms-ui-template-reference.html?icmpid=docs_a2i_lp",
            "description": "Use HTML elements to create custom worker user interfaces (UIs) for your human review workflows."
          },
          {
            "name": "Sample Task User Interfaces (UIs) ",
            "link": "https://github.com/aws-samples/amazon-a2i-sample-task-uis?icmpid=docs_a2i_lp",
            "description": "A GitHub repository of example task UIs built using HTML crowd elements."
          },
          {
            "name": "Jupyter Notebook Demos ",
            "link": "https://github.com/aws-samples/amazon-a2i-sample-jupyter-notebooks?icmpid=docs_a2i_lp",
            "description": "A GitHub repository of example Jupyter Notebooks that demonstrate how to integrate Amazon A2I in machine learning workflows."
          }
        ]
      }
    ]
  },
  {
    "service": "Amazon API Gateway",
    "shortDescription": "Build, deploy, and manage APIs",
    "url": "https://docs.aws.amazon.com/apigateway",
    "categories": ["Networking & Content Delivery", "Serverless"],
    "detailDescription": "Amazon API Gateway enables you to create and deploy your own REST and WebSocket APIs at any scale. You can create robust, secure, and scalable APIs that access Amazon Web Services or other web services, as well as data that’s stored in the AWS Cloud. You can create APIs to use in your own client applications, or you can make your APIs available to third-party app developers.",
    "sections": [
      {
        "items": [
          {
            "name": "Developer Guide",
            "link": "/apigateway/latest/developerguide/index.html",
            "description": "Provides a conceptual overview of Amazon API Gateway and includes detailed instructions for using the service."
          },
          {
            "name": "REST API Reference",
            "link": "/apigateway/api-reference/",
            "description": "Describes the API Gateway API operations for creating and deploying REST APIs."
          },
          {
            "name": "HTTP and WebSocket API Reference",
            "link": "/apigatewayv2/latest/api-reference/",
            "description": "Describes the API Gateway API operations for creating and deploying HTTP and WebSocket APIs."
          },
          {
            "name": "REST API CLI Reference",
            "link": "/cli/latest/reference/apigateway/index.html",
            "description": "Describes the API Gateway commands for creating and deploying REST APIs using the AWS CLI. Provides syntax, options, and usage examples for each command."
          },
          {
            "name": "HTTP and WebSocket API CLI Reference",
            "link": "/cli/latest/reference/apigatewayv2/index.html",
            "description": "Describes the API Gateway commands for creating and deploying HTTP and WebSocket APIs using the AWS CLI. Provides syntax, options, and usage examples for each command."
          }
        ]
      }
    ]
  },
  {
    "service": "Amazon AppFlow",
    "shortDescription": "No-code integration for SaaS apps and AWS services",
    "url": "https://docs.aws.amazon.com/appflow",
    "categories": ["Analytics"],
    "detailDescription": "Amazon AppFlow is a fully managed API integration service that you use to connect your software as a service (SaaS) applications to AWS services, and securely transfer data. Use Amazon AppFlow flows to manage and automate your data transfers without needing to write code.",
    "sections": [
      {
        "items": [
          {
            "name": "User Guide",
            "link": "/appflow/latest/userguide/index.html",
            "description": "Describes key concepts and provides instructions for using Amazon AppFlow."
          },
          {
            "name": "API Reference",
            "link": "/appflow/1.0/APIReference/index.html",
            "description": "Describes all the API operations for Amazon AppFlow in detail. Also provides sample requests, responses, and errors for the supported web service protocols."
          },
          {
            "name": "Amazon AppFlow in the AWS CLI ",
            "link": "https://awscli.amazonaws.com/v2/documentation/api/latest/reference/appflow/index.html",
            "description": "Describes the Amazon AppFlow operations that are available in the AWS Command Line Interface (AWS CLI)."
          },
          {
            "name": "Amazon AppFlow in the AWS CloudFormation User Guide",
            "link": "/AWSCloudFormation/latest/UserGuide/AWS_AppFlow.html",
            "description": "Describes all Amazon AppFlow resource and property types that are supported by AWS CloudFormation."
          },
          {
            "name": "Amazon AppFlow in the AWS SDK for Python (Boto3) ",
            "link": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/appflow.html",
            "description": "Describes all of the Amazon AppFlow operations that are included in the AWS SDK for Python (Boto3)."
          },
          {
            "name": "Amazon AppFlow in the AWS SDK for Java 2.x ",
            "link": "https://sdk.amazonaws.com/java/api/latest/software/amazon/awssdk/services/appflow/package-summary.html",
            "description": "Describes all of the Amazon AppFlow operations that are included the AWS SDK for Java 2.x."
          },
          {
            "name": "Amazon AppFlow Custom Connector SDK (Python) ",
            "link": "https://github.com/awslabs/aws-appflow-custom-connector-python",
            "description": "Use the Python Custom Connector SDK to build custom source and destination connectors for Amazon AppFlow. With custom connectors, you can transfer data between private APIs, on-premise systems, other cloud services, and AWS."
          },
          {
            "name": "Amazon AppFlow Custom Connector SDK (Java) ",
            "link": "https://github.com/awslabs/aws-appflow-custom-connector-java",
            "description": "Use the Java Custom Connector SDK to build custom source and destination connectors for Amazon AppFlow. With custom connectors, you can transfer data between private APIs, on-premise systems, other cloud services, and AWS."
          }
        ]
      }
    ]
  },
  {
    "service": "Amazon Application Recovery Controller (ARC)",
    "shortDescription": "Move traffic for application disaster recovery",
    "url": "https://docs.aws.amazon.com/amazonarc",
    "categories": ["Networking & Content Delivery"],
    "detailDescription": "Amazon Application Recovery Controller (ARC) (ARC) gives you insights about whether your applications and resources are ready for recovery, and helps you move traffic across AWS Regions or away from Availability Zones for application disaster recovery.",
    "sections": [
      {
        "items": [
          {
            "name": "Developer Guide",
            "link": "/r53recovery/latest/dg/index.html",
            "description": "Provides a conceptual overview of Amazon Application Recovery Controller (ARC) and includes detailed instructions for using the various features."
          },
          {
            "name": "Zonal Shift and Zonal Autoshift API Reference",
            "link": "/arc-zonal-shift/latest/api/index.html",
            "description": "Describes all the API operations for zonal shift and zonal autoshift in ARC. Also provides sample requests, responses, and errors for the supported web services protocols."
          },
          {
            "name": "Recovery Readiness API Reference",
            "link": "/recovery-readiness/latest/api/index.html",
            "description": "Describes all the API operations for recovery readiness in ARC. Also provides sample requests, responses, and errors for the supported web services protocols."
          },
          {
            "name": "Recovery Control Configuration API Reference",
            "link": "/recovery-cluster/latest/api/index.html",
            "description": "Describes all the API operations for configuring recovery control in ARC. Also provides sample requests, responses, and errors for the supported web services protocols."
          },
          {
            "name": "Routing Control API Reference",
            "link": "/routing-control/latest/APIReference/index.html",
            "description": "Describes all the API operations for routing controls in ARC. Also provides sample requests, responses, and errors for the supported web services protocols."
          },
          {
            "name": "Zonal Shift in the AWS CLI Reference",
            "link": "/cli/latest/reference/arc-zonal-shift/index.html",
            "description": "Describes the commands in the AWS CLI that you can use to move traffic away from an Availability Zone using a zonal shift in ARC. Provides syntax, options, and usage examples for each command."
          },
          {
            "name": "Recovery Readiness in the AWS CLI Reference",
            "link": "/cli/latest/reference/route53-recovery-readiness/index.html",
            "description": "Describes the commands in the AWS CLI that you can use to configure recovery readiness in ARC. Provides syntax, options, and usage examples for each command."
          },
          {
            "name": "Recovery Control Configuration in the AWS CLI Reference",
            "link": "/cli/latest/reference/route53-recovery-control-config/index.html",
            "description": "Describes the commands in the AWS CLI that you can use to configure recovery control in ARC. Provides syntax, options, and usage examples for each command."
          },
          {
            "name": "Routing Control in the AWS CLI Reference",
            "link": "/cli/latest/reference/route53-recovery-cluster/index.html",
            "description": "Describes the commands in the AWS CLI that you can use with routing control states in ARC. Provides syntax, options, and usage examples for each command."
          }
        ]
      }
    ]
  },
  {
    "service": "Amazon AppStream 2.0",
    "shortDescription": "Stream desktop applications securely to a browser",
    "url": "https://docs.aws.amazon.com/appstream2",
    "categories": ["End User Computing"],
    "detailDescription": "Amazon AppStream 2.0 is a fully managed, secure application streaming service that lets you stream desktop applications to users without rewriting applications. AppStream 2.0 provides users with instant access to the applications that they need with a responsive, fluid user experience on the device of their choice.",
    "sections": [
      {
        "items": [
          {
            "name": "Administration Guide",
            "link": "/appstream2/latest/developerguide/index.html",
            "description": "Provides a conceptual overview of AppStream 2.0 and includes detailed instructions for using the features available in this service."
          },
          {
            "name": "API Reference",
            "link": "/appstream2/latest/APIReference/index.html",
            "description": "Describes all the API operations for AppStream 2.0 in detail. Also provides sample requests, responses, and errors for the supported web services protocols."
          },
          {
            "name": "AppStream 2.0 section in the AWS CLI Reference",
            "link": "/cli/latest/reference/appstream/index.html",
            "description": "Describes the AppStream 2.0 commands that are available in the AWS Command Line Interface (AWS CLI)."
          }
        ]
      },
      {
        "name": "NICE DCV Extension SDK",
        "items": [
          {
            "name": "Extension SDK Developer Guide",
            "link": "/appstream2/latest/developerguide/extension-sdk.html",
            "description": "Describes how to get started with the Amazon DCV Extension SDK that is supported by AppStream 2.0 and provides an SDK reference."
          }
        ]
      }
    ]
  },
  {
    "service": "Amazon Athena",
    "shortDescription": "Query data in Amazon S3 using SQL",
    "url": "https://docs.aws.amazon.com/athena",
    "categories": ["Analytics"],
    "detailDescription": "Amazon Athena is an interactive query service that makes it easy to analyze data in Amazon S3 using standard SQL. Athena is serverless, so there is no infrastructure to setup or manage, and you pay only for the queries you run. To get started, simply point to your data in S3, define the schema, and start querying using standard SQL.",
    "sections": [
      {
        "items": [
          {
            "name": "User Guide",
            "link": "/athena/latest/ug/what-is.html",
            "description": "Learn how to use Athena to query data stored in Amazon S3."
          },
          {
            "name": "API Reference",
            "link": "/athena/latest/APIReference/index.html",
            "description": "Describes the Athena API operations in detail."
          }
        ]
      }
    ]
  },
  {
    "service": "Amazon Aurora",
    "shortDescription": "High performance managed relational database engine",
    "url": "https://docs.aws.amazon.com/rds",
    "categories": ["Database"],
    "detailDescription": "Amazon Relational Database Service (Amazon RDS) is a web service that makes it easier to set up, operate, and scale a relational database in the cloud. It provides cost-efficient, resizeable capacity for an industry-standard relational database and manages common database administration tasks. Amazon Aurora is a fully managed relational database engine that's built for the cloud and compatible with MySQL and PostgreSQL. Amazon Aurora is part of Amazon RDS.",
    "sections": [
      {
        "name": "User Guides",
        "items": [
          {
            "name": "Amazon RDS User Guide",
            "link": "/AmazonRDS/latest/UserGuide/index.html",
            "description": "Describes all Amazon RDS concepts and provides instructions on using the various features with both the console and the command line interface."
          },
          {
            "name": "Amazon Aurora User Guide",
            "link": "/AmazonRDS/latest/AuroraUserGuide/index.html",
            "description": "Describes all Amazon Aurora concepts and provides instructions on using the various features with both the console and the command line interface."
          },
          {
            "name": "Amazon Aurora DSQL User Guide",
            "link": "/aurora-dsql/latest/userguide/index.html",
            "description": "Describes all Amazon Aurora DSQL concepts and provides instructions on using the various features."
          },
          {
            "name": "Amazon RDS Getting Started Guide",
            "link": "/AmazonRDS/latest/gettingstartedguide/index.html",
            "description": "Introduces Amazon RDS and walks you through setting up, securing, managing, and connecting to your first DB instance."
          }
        ]
      },
      {
        "name": "References",
        "items": [
          {
            "name": "Amazon RDS in the AWS CLI Reference",
            "link": "/cli/latest/reference/rds/",
            "description": "Describes all the CLI commands for Amazon RDS in detail. Provides all syntax. Also provides examples for the most common commands."
          },
          {
            "name": "Performance Insights in the AWS CLI Reference",
            "link": "/cli/latest/reference/pi/",
            "description": "Describes all the CLI commands for Amazon RDS Performance Insights in detail. Provides all syntax. Also provides examples for the most common commands."
          },
          {
            "name": "RDS Data API in the AWS CLI Reference",
            "link": "/cli/latest/reference/rds-data/",
            "description": "Describes all the CLI commands for RDS Data API in detail. Provides all syntax."
          },
          {
            "name": "Amazon RDS API Reference",
            "link": "/AmazonRDS/latest/APIReference/index.html",
            "description": "Describes all the API operations for Amazon RDS in detail. Also provides sample requests, responses, and errors for the supported web services protocols."
          },
          {
            "name": "Performance Insights API Reference",
            "link": "/performance-insights/latest/APIReference/index.html",
            "description": "Describes all the API operations for Performance Insights in detail. Also provides sample requests, responses, and errors for the supported web service protocols."
          },
          {
            "name": "RDS Data API Reference",
            "link": "/rdsdataservice/latest/APIReference/index.html",
            "description": "Describes all operations for RDS Data API in detail. Also provides sample requests, responses, and errors for the supported web service protocols."
          }
        ]
      },
      {
        "name": "Release Notes",
        "items": [
          {
            "name": "Amazon RDS for Oracle Release Notes",
            "link": "/AmazonRDS/latest/OracleReleaseNotes/index.html",
            "description": "Describes the Oracle Database versions that are supported by Amazon RDS."
          },
          {
            "name": "Amazon RDS for PostgreSQL Release Notes",
            "link": "/AmazonRDS/latest/PostgreSQLReleaseNotes/index.html",
            "description": "Describes the PostgreSQL versions and extensions that are supported by Amazon RDS."
          },
          {
            "name": "Release Notes for Aurora MySQL",
            "link": "/AmazonRDS/latest/AuroraMySQLReleaseNotes/index.html",
            "description": "Describes the Aurora MySQL versions that are supported by Amazon Aurora."
          },
          {
            "name": "Release Notes for Aurora PostgreSQL",
            "link": "/AmazonRDS/latest/AuroraPostgreSQLReleaseNotes/index.html",
            "description": "Describes the Aurora PostgreSQL versions and extensions that are supported by Amazon Aurora."
          }
        ]
      },
      {
        "name": "Best Practices",
        "items": [
          {
            "name": "Architecture Center: Best Practices for Databases ",
            "link": "https://aws.amazon.com/architecture/databases/",
            "description": "Find best practices for choosing the right AWS database service, migrating your database, and managing database services."
          }
        ]
      }
    ]
  },
  {
    "service": "Amazon Aurora DSQL",
    "shortDescription": "Fastest serverless distributed SQL database for always available applications",
    "url": "https://docs.aws.amazon.com/aurora-dsql",
    "categories": ["Database"],
    "detailDescription": "Amazon Aurora DSQL is a serverless distributed SQL database with virtually unlimited scale, high availability, and zero infrastructure management. Aurora DSQL offers fast distributed SQL reads and writes with optimal price performance. You can use Aurora DSQL to scale to meet any workload demand without database sharding or instance upgrades. With its active-active distributed architecture, Aurora DSQL ensures strong data consistency designed for 99.99% single-Region and 99.999% multi-Region availability. The serverless design removes the operational burden of patching, upgrades, and maintenance downtime. Aurora DSQL is PostgreSQL compatible, and provides an easy-to-use developer experience.",
    "sections": [
      {
        "items": [
          {
            "name": "Getting started with Amazon Aurora DSQL",
            "link": "latest/userguide/getting-started.html",
            "description": "Learn how to get started with Aurora DSQL by creating a cluster and running some SQL queries."
          },
          {
            "name": "Developer Guide",
            "link": "latest/userguide/what-is-aurora-dsql.html",
            "description": "Describes all Amazon Aurora DSQL concepts and provides instructions on using the various features."
          },
          {
            "name": "API Reference",
            "link": "latest/APIReference/Welcome.html",
            "description": "Describes in detail all the API operations for Amazon Aurora DSQL."
          }
        ]
      }
    ]
  },
  {
    "service": "Amazon Bedrock",
    "shortDescription": "Access best-in-class foundation models to build generative AI applications",
    "url": "https://docs.aws.amazon.com/bedrock",
    "categories": ["Machine Learning"],
    "detailDescription": "Amazon Bedrock is a fully managed service that makes it easy to use foundation models from third-party providers and Amazon.",
    "sections": [
      {
        "name": "Getting started",
        "items": [
          {
            "name": "Get started with Amazon Bedrock",
            "link": "/bedrock/latest/userguide/getting-started.html",
            "description": "Get started with the Amazon Bedrock console and API."
          },
          {
            "name": "Get started with Amazon Nova",
            "link": "/nova/latest/userguide/getting-started.html",
            "description": "Get started with the Amazon Nova console and API."
          }
        ]
      },
      {
        "name": "Documentation and SDKs",
        "items": [
          {
            "name": "Amazon Bedrock User Guide",
            "link": "/bedrock/latest/userguide/index.html",
            "description": "Describes how to use the Amazon Bedrock console and API."
          },
          {
            "name": "API Reference",
            "link": "/bedrock/latest/APIReference/index.html",
            "description": "Describes the Amazon Bedrock API operations and parameters."
          },
          {
            "name": "Code examples",
            "link": "/bedrock/latest/userguide/service_code_examples.html",
            "description": "Examples that show how to write code for your Amazon Bedrock application."
          }
        ]
      },
      {
        "name": "Inference and assessment",
        "items": [
          {
            "name": "Inference",
            "link": "/bedrock/latest/userguide/inference.html",
            "description": "Use inference to generate responses from Amazon Bedrock models."
          },
          {
            "name": "Cross-region inference",
            "link": "/bedrock/latest/userguide/cross-region-inference.html",
            "description": "Route your inference requests across multiple AWS Regions during peak utilization bursts."
          },
          {
            "name": "Inference profiles",
            "link": "/bedrock/latest/userguide/inference-profiles.html",
            "description": "Use a profile to route inference requests to a model and one or more AWS Regions."
          },
          {
            "name": "Batch inference",
            "link": "/bedrock/latest/userguide/batch-inference.html",
            "description": "Run model inferences asynchronously in batches."
          },
          {
            "name": "Provisioned throughput",
            "link": "/bedrock/latest/userguide/prov-throughput.html",
            "description": "Dedicate capacity for your models."
          },
          {
            "name": "Evaluation",
            "link": "/bedrock/latest/userguide/evaluation.html",
            "description": "Evaluate the performance of Amazon Bedrock resources."
          }
        ]
      },
      {
        "name": "Foundation models",
        "items": [
          {
            "name": "Foundation model information",
            "link": "/bedrock/latest/userguide/foundation-models-reference.html",
            "description": "Find information about Amazon Bedrock models."
          },
          {
            "name": "Foundation model marketplace",
            "link": "/bedrock/latest/userguide/amazon-bedrock-marketplace.html",
            "description": "Find popular, emerging, and specialized foundation models."
          },
          {
            "name": "Custom models",
            "link": "/bedrock/latest/userguide/custom-models.html",
            "description": "Customize a model with Fine-tuning, Distillation or Continued Pre-training."
          },
          {
            "name": "Import models",
            "link": "/bedrock/latest/userguide/model-customization-import-model.html",
            "description": "Import foundation models that you have customized in other environments."
          },
          {
            "name": "Prompt routing",
            "link": "/bedrock/latest/userguide/prompt-routing.html",
            "description": "Efficiently route requests between different foundational models within the same model family."
          }
        ]
      },
      {
        "name": "Builder tools",
        "items": [
          {
            "name": "Agents",
            "link": "/bedrock/latest/userguide/agents.html",
            "description": "Build and configure autonomous agents in your application."
          },
          {
            "name": "Flows",
            "link": "/bedrock/latest/userguide/flows.html",
            "description": "Connect Amazon Bedrock features and other AWS services to create generative AI workflows."
          },
          {
            "name": "Knowledge bases",
            "link": "/bedrock/latest/userguide/knowledge-base.html",
            "description": "Improve model responses by using Retrieval Augmented Generation (RAG) with your data."
          },
          {
            "name": "Prompt management",
            "link": "/bedrock/latest/userguide/prompt-management.html",
            "description": "Create reusable prompts for your applications."
          },
          {
            "name": "Guardrails",
            "link": "/bedrock/latest/userguide/guardrails.html",
            "description": "Implement application-specific safeguards based on your use cases and responsible AI policies."
          }
        ]
      },
      {
        "name": "Data automation",
        "items": [
          {
            "name": "Data automation",
            "link": "/bedrock/latest/userguide/bda.html",
            "description": "Extract valuable insights from unstructured content."
          }
        ]
      },
      {
        "name": "Security",
        "items": [
          {
            "name": "Security",
            "link": "/bedrock/latest/userguide/security.html",
            "description": "Configure Amazon Bedrock to meet your security and compliance objectives."
          },
          {
            "name": "Identity based policies",
            "link": "/bedrock/latest/userguide/security_iam_id-based-policy-examples.html",
            "description": "Grant users permission to perform actions on Amazon Bedrock with IAM policies."
          },
          {
            "name": "AWS managed policies ",
            "link": "/bedrock/latest/userguide/security-iam-awsmanpol.html",
            "description": "Grant users permission to perform actions on Amazon Bedrock with IAM policies."
          },
          {
            "name": "AWS service roles",
            "link": "/bedrock/latest/userguide/security-iam-sr.html",
            "description": "Use IAM service roles for some features to let Amazon Bedrock carry out tasks on your behalf."
          }
        ]
      },
      {
        "name": "Resources",
        "items": [
          {
            "name": "Amazon Bedrock in Amazon\n              SageMaker Unified Studio",
            "link": "https://docs.aws.amazon.com/sagemaker-unified-studio/latest/userguide/bedrock.html",
            "description": "Learn how to use Amazon Bedrock in Amazon SageMaker Unified Studio."
          },
          {
            "name": "Amazon Bedrock blogs ",
            "link": "https://aws.amazon.com/blogs/machine-learning/category/artificial-intelligence/amazon-machine-learning/amazon-bedrock/",
            "description": "Read the Amazon Bedrock blogs."
          },
          {
            "name": "Amazon Bedrock FAQs ",
            "link": "https://aws.amazon.com/bedrock/faqs/index.html",
            "description": "Find answers to frequently asked questions."
          },
          {
            "name": "Responsible AI ",
            "link": "https://aws.amazon.com/ai/responsible-ai/index.html",
            "description": "Transform responsible AI from theory into practice."
          },
          {
            "name": "Amazon Bedrock re:Post Forum ",
            "link": "https://repost.aws/tags/TAQeKlaPaNRQ2tWB6P7KrMag/amazon-bedrock",
            "description": "Find crowd-sourced, expert-reviewed answers to your Amazon Bedrock questions."
          },
          {
            "name": "Amazon Bedrock product page ",
            "link": "https://aws.amazon.com/bedrock/",
            "description": "Get more information about Amazon Bedrock."
          }
        ]
      }
    ]
  },
  {
    "service": "Amazon Braket",
    "shortDescription": "Accelerate quantum computing research",
    "url": "https://docs.aws.amazon.com/braket",
    "categories": ["Quantum Computing"],
    "detailDescription": "Amazon Braket is a fully managed service that helps you get started with quantum computing by providing a development environment to explore and design quantum algorithms, test them on simulated quantum computers, and run them on your choice of different quantum hardware technologies.",
    "sections": [
      {
        "items": [
          {
            "name": "Developer Guide",
            "link": "/braket/latest/developerguide/index.html",
            "description": "Provides a conceptual overview of Amazon Braket, and detailed information about how to design and create quantum tasks, test them on quantum simulators, and then run them on a quantum computer."
          },
          {
            "name": "API Reference",
            "link": "/braket/latest/APIReference/index.html",
            "description": "The Amazon Braket API Reference provides information about the operations and structures supported by Amazon Braket."
          },
          {
            "name": "Amazon Braket Boto 3 SDK ",
            "link": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/braket.html",
            "description": "Allows you to interact with Amazon Braket using the AWS SDK for Python (Boto3)."
          },
          {
            "name": "Braket Open Source ",
            "link": "https://github.com/amazon-braket",
            "description": "The Amazon Braket GitHub organization provides a good starting point to discover multiple frameworks and educational content. The material is open sourced and builds on top of Amazon Braket."
          }
        ]
      }
    ]
  },
  {
    "service": "Amazon Chime",
    "shortDescription": "Frustration-free meetings, video calls, and chat",
    "url": "https://docs.aws.amazon.com/chime",
    "categories": ["Business Applications"],
    "detailDescription": "Amazon Chime is a secure, real-time, unified communications service that transforms meetings by making them more efficient and easier to conduct.",
    "sections": [
      {
        "items": [
          {
            "name": "Administrator Guide",
            "link": "/chime/latest/ag/what-is-chime.html",
            "description": "Helps you use Amazon Chime to perform several administrative tasks, such as creating an Amazon Chime account, inviting users, and managing licenses."
          },
          {
            "name": "User Guide",
            "link": "/chime/latest/ug/what-is-chime.html",
            "description": "Helps you use Amazon Chime, including joining, attending, and scheduling meetings for your organization."
          },
          {
            "name": "API Reference",
            "link": "/chime/latest/APIReference/index.html",
            "description": "Describes the API operations for Amazon Chime."
          },
          {
            "name": "Amazon Chime section of AWS CLI Reference",
            "link": "/cli/latest/reference/chime/index.html",
            "description": "Documents the Amazon Chime commands available in the AWS Command Line Interface (AWS CLI)."
          }
        ]
      }
    ]
  },
  {
    "service": "Amazon Cloud Directory",
    "shortDescription": "Store hundreds of millions of application-specific objects",
    "url": "https://docs.aws.amazon.com/clouddirectory",
    "categories": ["Security, Identity, & Compliance"],
    "detailDescription": "Amazon Cloud Directory is a cloud-native directory that can store hundreds of millions of application-specific objects with multiple relationships and schemas. Use Cloud Directory when you need a cloud-scale directory to share and control access to hierarchical data between your applications. With Cloud Directory, you can organize application data into multiple hierarchies to support many organizational pivots and relationships across directory information.",
    "sections": [
      {
        "items": [
          {
            "name": "Developer Guide",
            "link": "/clouddirectory/latest/developerguide/index.html",
            "description": "Describes how to create and manage an Amazon Cloud Directory schema and directory for use with your website or application. Also provides instructions for using the various features through the AWS Directory Service console."
          },
          {
            "name": "API Reference",
            "link": "/clouddirectory/latest/APIReference/index.html",
            "description": "Describes the API operations for Amazon Cloud Directory."
          },
          {
            "name": "Amazon Cloud Directory in the AWS CLI Reference",
            "link": "/cli/latest/reference/clouddirectory/index.html",
            "description": "Describes the Cloud Directory commands in the AWS Command Line Interface."
          }
        ]
      }
    ]
  },
  {
    "service": "Amazon CloudFront",
    "shortDescription": "Global content delivery network",
    "url": "https://docs.aws.amazon.com/cloudfront",
    "categories": ["Networking & Content Delivery"],
    "detailDescription": "Amazon CloudFront speeds up distribution of your static and dynamic web content, such as .html, .css, .php, image, and media files. When users request your content, CloudFront delivers it through a worldwide network of edge locations that provide low latency and high performance.",
    "sections": [
      {
        "items": [
          {
            "name": "Developer Guide",
            "link": "/AmazonCloudFront/latest/DeveloperGuide/index.html",
            "description": "Provides an overview of Amazon CloudFront, detailed feature descriptions, procedures for using the console, and an explanation of the API."
          },
          {
            "name": "API Reference",
            "link": "/cloudfront/latest/APIReference/Welcome.html",
            "description": "Describes all the API operations for Amazon CloudFront in detail. Also provides sample requests, responses, and errors for the supported web services protocols."
          }
        ]
      }
    ]
  },
  {
    "service": "Amazon CloudSearch",
    "shortDescription": "Managed search service",
    "url": "https://docs.aws.amazon.com/cloudsearch",
    "categories": ["Analytics"],
    "detailDescription": "Amazon CloudSearch is a fully managed service in the cloud that makes it easy to set up, manage, and scale a search solution for your website. Amazon CloudSearch enables you to search large collections of data such as web pages, document files, forum posts, or product information. With Amazon CloudSearch, you can quickly add search capabilities to your website without having to become a search expert or worry about hardware provisioning, setup, and maintenance. As your volume of data and traffic fluctuates, Amazon CloudSearch automatically scales to meet your needs.",
    "sections": [
      {
        "items": [
          {
            "name": "Developer Guide",
            "link": "/cloudsearch/latest/developerguide/index.html",
            "description": "Describes how to create, manage, and use an Amazon CloudSearch domain to implement a search solution for your website or application. Also provides instructions for using the various features through the AWS Management Console, CLI, and API."
          }
        ]
      }
    ]
  },
  {
    "service": "Amazon CloudWatch",
    "shortDescription": "Monitor resources and applications",
    "url": "https://docs.aws.amazon.com/cloudwatch",
    "categories": ["Management & Governance"],
    "detailDescription": "Amazon CloudWatch provides a reliable, scalable, and flexible monitoring solution that you can start using within minutes. You no longer need to set up, manage, and scale your own monitoring systems and infrastructure.",
    "sections": [
      {
        "name": "Amazon CloudWatch",
        "items": [
          {
            "name": "CloudWatch User Guide",
            "link": "/AmazonCloudWatch/latest/monitoring/index.html",
            "description": "Provides a conceptual overview of CloudWatch and includes detailed development instructions for using the various features."
          },
          {
            "name": "CloudWatch API Reference",
            "link": "/AmazonCloudWatch/latest/APIReference/index.html",
            "description": "Describes all the API operations for CloudWatch in detail. Also provides sample requests, responses, and errors for the supported web services protocols."
          },
          {
            "name": "CloudWatch Application Insights API Reference",
            "link": "/cloudwatch/latest/APIReference/index.html",
            "description": "Describes all the API operations for CloudWatch Application Insights in detail. Also provides sample requests, responses, and errors for the supported web services protocols."
          },
          {
            "name": "CloudWatch Synthetics API Reference",
            "link": "/AmazonSynthetics/latest/APIReference/index.html",
            "description": "Describes all the API operations for CloudWatch Synthetics in detail. Also provides sample requests, responses, and errors for the supported web services protocols."
          },
          {
            "name": "CloudWatch Application Signals API Reference",
            "link": "/applicationsignals/latest/APIReference/index.html",
            "description": "Describes all the API operations for CloudWatch Application Signals in detail. Also provides sample requests, responses, and errors for the supported web services protocols."
          },
          {
            "name": "Network Flow Monitor API Reference",
            "link": "/networkflowmonitor/2.0/APIReference/index.html",
            "description": "Describes all the API operations for Network Flow Monitor in detail. Also provides sample requests, responses, and errors for the supported web services protocols."
          },
          {
            "name": "Internet Monitor API Reference",
            "link": "/internet-monitor/latest/api/index.html",
            "description": "Describes all the API operations for CloudWatch Internet Monitor in detail. Also provides sample requests, responses, and errors for the supported web services protocols."
          },
          {
            "name": "Network Synthetic Monitor API Reference",
            "link": "/networkmonitor/latest/APIReference/index.html",
            "description": "Describes all the API operations for Network Synthetic Monitor in detail. Also provides sample requests, responses, and errors for network monitor and probe operations."
          },
          {
            "name": "CloudWatch Observability Access Manager API Reference",
            "link": "/OAM/latest/APIReference/index.html",
            "description": "Describes all the API operations for CloudWatch Observability Access Manager in detail. Also provides sample requests, responses, and errors for the supported web services protocols."
          },
          {
            "name": "CloudWatch RUM API Reference",
            "link": "/cloudwatchrum/latest/APIReference/index.html",
            "description": "Describes all the API operations for CloudWatch RUM in detail. Also provides sample requests, responses, and errors for the supported web services protocols."
          },
          {
            "name": "CloudWatch Evidently API Reference",
            "link": "/cloudwatchevidently/latest/APIReference/index.html",
            "description": "Describes all the API operations for CloudWatch Evidently in detail. Also provides sample requests, responses, and errors for the supported web services protocols."
          },
          {
            "name": "CloudWatch Observability Admin API Reference",
            "link": "/cloudwatch/latest/observabilityadmin/index.html",
            "description": "Describes all the API operations for CloudWatch Observability Admin in detail. Also provides sample requests, responses, and errors for the supported web service protocols."
          },
          {
            "name": "CloudWatch section of the AWS CLI Reference",
            "link": "/cli/latest/reference/cloudwatch/index.html",
            "description": "Describes the CloudWatch commands in the AWS CLI that you can use to monitor AWS. Provides syntax, options, and usage examples for each command."
          },
          {
            "name": "CloudWatch Application Insights section of the AWS CLI Reference",
            "link": "/cli/latest/reference/application-insights/index.html",
            "description": "Describes the CloudWatch commands in the AWS CLI that you can use to detect common problems with your applications. Provides syntax, options, and usage examples for each command."
          },
          {
            "name": "CloudWatch Synthetics section of the AWS CLI Reference",
            "link": "/cli/latest/reference/synthetics/index.html",
            "description": "Describes the CloudWatch Synthetics commands in the AWS CLI that you can use to create and manage canaries. Provides syntax, options, and usage examples for each command."
          },
          {
            "name": "CloudWatch CLI Reference",
            "link": "/AmazonCloudWatch/latest/cli/index.html",
            "description": "Describes the CloudWatch CLI commands that you can use to monitor AWS. Provides syntax, options, and usage examples for each command."
          }
        ]
      },
      {
        "name": "Amazon CloudWatch Logs",
        "items": [
          {
            "name": "CloudWatch Logs User Guide",
            "link": "/AmazonCloudWatch/latest/logs/index.html",
            "description": "Provides a conceptual overview of CloudWatch Logs and includes detailed development instructions for using the various features."
          },
          {
            "name": "CloudWatch Logs API Reference",
            "link": "/AmazonCloudWatchLogs/latest/APIReference/index.html",
            "description": "Describes all the API operations for CloudWatch Logs in detail. Also provides sample requests, responses, and errors for the supported web services protocols."
          },
          {
            "name": "CloudWatch Logs section of the AWS CLI Reference",
            "link": "/cli/latest/reference/logs/index.html",
            "description": "Describes the AWS CLI commands that you can use to administer CloudWatch Logs. Provides syntax, options, and usage examples for each command."
          }
        ]
      },
      {
        "name": "Amazon CloudWatch Events is now Amazon EventBridge",
        "items": [
          {
            "name": "EventBridge User Guide",
            "link": "/eventbridge/latest/userguide/index.html",
            "description": "Provides a conceptual overview of EventBridge and includes detailed development instructions for using the various features."
          },
          {
            "name": "EventBridge API Reference",
            "link": "/eventbridge/latest/APIReference/index.html",
            "description": "Describes all the API operations for EventBridge in detail. Also provides sample requests, responses, and errors for the supported web services protocols."
          },
          {
            "name": "EventBridge section of the AWS CLI Reference",
            "link": "/cli/latest/reference/events/index.html",
            "description": "Describes the AWS CLI commands that you can use to administer EventBridge. Provides syntax, options, and usage examples for each command."
          }
        ]
      }
    ]
  },
  {
    "service": "Amazon CodeCatalyst",
    "shortDescription": "Unified software development service to develop and deliver on AWS",
    "url": "https://docs.aws.amazon.com/codecatalyst",
    "categories": ["Developer Tools"],
    "detailDescription": "Amazon CodeCatalyst is a cloud-based collaboration space for software development teams. CodeCatalyst provides one place where you can plan work, collaborate on code, and build, test, and deploy applications with continuous integration/continuous delivery (CI/CD) tools.",
    "sections": [
      {
        "items": [
          {
            "name": "User Guide",
            "link": "/codecatalyst/latest/userguide",
            "description": "Learn how to use Amazon CodeCatalyst to track work, develop code, and build, test, and deploy your applications."
          },
          {
            "name": "API Reference",
            "link": "/codecatalyst/latest/APIReference/index.html",
            "description": "Describes API operations for Amazon CodeCatalyst in detail. Also provides details of request and response syntax and errors for the supported web services protocols."
          },
          {
            "name": "Administrator Guide",
            "link": "/codecatalyst/latest/adminguide/index.html",
            "description": "Learn how to set up an Amazon CodeCatalyst space where users can collaborate on projects. Find out how to view your billing information and upgrade your subscription."
          },
          {
            "name": "Blueprints Resources",
            "description": "Learn how to use blueprints to create new projects or apply them to existing projects. Also learn how to develop custom blueprints for your spaces. The open-source GitHub repository provides access to the blueprints SDK and sample blueprints."
          },
          {
            "name": "Action Developer Guide",
            "link": "/codecatalyst/latest/adk/index.html",
            "description": "Learn how to create custom actions for your workflows using the Amazon CodeCatalyst Action Developer Guide."
          },
          {
            "name": "Set up Support for Amazon CodeCatalyst",
            "link": "/codecatalyst/latest/userguide/support",
            "description": "Learn how administrators can set up the support plan and roles required to create and manage support cases for their CodeCatalyst space. Once configured, space and project members can create support cases through Support for Amazon CodeCatalyst."
          },
          {
            "name": "Additional Resources",
            "description": "Learn more about how to use Amazon CodeCatalyst, common questions, and how to get help from the community when using CodeCatalyst."
          }
        ]
      }
    ]
  },
  {
    "service": "Amazon CodeGuru",
    "shortDescription": "Find your most expensive lines of code",
    "url": "https://docs.aws.amazon.com/codeguru",
    "categories": ["Machine Learning"],
    "detailDescription": "CodeGuru provides intelligent recommendations for improving application performance, efficiency, security, and code quality.",
    "sections": [
      {
        "name": "Amazon CodeGuru Security",
        "items": [
          {
            "name": "User Guide",
            "link": "/codeguru/latest/security-ug/index.html",
            "description": "Provides a conceptual overview of Amazon CodeGuru Security, instructions for getting started, product and service integrations, and creating and understanding code scans."
          },
          {
            "name": "API Reference",
            "link": "/codeguru/latest/security-api/index.html",
            "description": "Describes all the Amazon CodeGuru Security API operations in detail. Also provides sample requests, responses, and errors for the supported web services protocols."
          },
          {
            "name": "CodeGuru Security section of the AWS CLI Reference ",
            "link": "https://awscli.amazonaws.com/v2/documentation/api/latest/reference/codeguru-security/index.html",
            "description": "Describes the AWS CLI commands that you can use to work with CodeGuru Security code scans."
          },
          {
            "name": "Detector Library",
            "link": "https://docs.aws.amazon.com/codeguru/detector-library/index.html",
            "description": "Lists all detectors that Amazon CodeGuru Security uses to analyze code. Provides detailed information about the detectors, their impact on applications, and ways to mitigate risk."
          }
        ]
      },
      {
        "name": "Amazon CodeGuru Profiler",
        "items": [
          {
            "name": "User Guide",
            "link": "/codeguru/latest/profiler-ug/index.html",
            "description": "Provides a conceptual overview of Amazon CodeGuru Profiler, instructions for creating profile groups, using graphs and filters, reviewing recommendations, and exploring code."
          },
          {
            "name": "API Reference",
            "link": "/codeguru/latest/profiler-api/index.html",
            "description": "Describes all the Amazon CodeGuru Profiler API operations in detail. Also provides sample requests, responses, and errors for the supported web services protocols."
          },
          {
            "name": "CodeGuru Profiler section of the AWS CLI Reference ",
            "link": "https://awscli.amazonaws.com/v2/documentation/api/latest/reference/codeguruprofiler/index.html",
            "description": "Describes the AWS CLI commands that you can use to work with profiling groups."
          }
        ]
      },
      {
        "name": "Amazon CodeGuru Reviewer",
        "items": [
          {
            "name": "User Guide",
            "link": "/codeguru/latest/reviewer-ug/index.html",
            "description": "Provides a conceptual overview of Amazon CodeGuru Reviewer, instructions for getting started, product and service integrations, and review recommendations."
          },
          {
            "name": "API Reference",
            "link": "/codeguru/latest/reviewer-api/index.html",
            "description": "Describes all the Amazon CodeGuru Reviewer API operations in detail. Also provides sample requests, responses, and errors for the supported web services protocols."
          },
          {
            "name": "CodeGuru Reviewer section of the AWS CLI Reference ",
            "link": "https://awscli.amazonaws.com/v2/documentation/api/latest/reference/codeguru-reviewer/index.html",
            "description": "Describes the AWS CLI commands that you can use to work with CodeGuru Reviewer repository associations and code reviews."
          }
        ]
      },
      {
        "name": "AWS BugBust",
        "items": [
          {
            "name": "User Guide",
            "link": "/codeguru/latest/bugbust-ug/index.html",
            "description": "Describes how to create and participate in a competitive AWS BugBust event that incentivizes fixing bugs and optimizing profiling groups by a development team."
          }
        ]
      }
    ]
  },
  {
    "service": "Amazon Cognito",
    "shortDescription": "Identity management for your apps",
    "url": "https://docs.aws.amazon.com/cognito",
    "categories": ["Security, Identity, & Compliance"],
    "detailDescription": "Amazon Cognito handles user authentication and authorization for your web and mobile apps. With user pools, you can easily and securely add sign-up and sign-in functionality to your apps. With identity pools (federated identities), your apps can get temporary credentials that grant users access to specific AWS resources, whether the users are anonymous or are signed in.",
    "sections": [
      {
        "name": "Amazon Cognito User Pools",
        "items": [
          {
            "name": "Developer Guide",
            "link": "/cognito/latest/developerguide/cognito-user-identity-pools.html",
            "description": "Provides a conceptual overview of Amazon Cognito user pools and includes instructions that show you how to use its features."
          },
          {
            "name": "API Reference",
            "link": "/cognito-user-identity-pools/latest/APIReference/index.html",
            "description": "Describes the REST API for user pools."
          },
          {
            "name": "AWS CLI Reference",
            "link": "/cli/latest/reference/cognito-idp/index.html",
            "description": "Describes the AWS CLI commands for user pools."
          }
        ]
      },
      {
        "name": "Amazon Cognito Identity Pools (Federated Identities)",
        "items": [
          {
            "name": "Developer Guide",
            "link": "/cognito/latest/developerguide/cognito-identity.html",
            "description": "Provides a conceptual overview of Amazon Cognito identity pools and includes instructions that show you how to use its features."
          },
          {
            "name": "API Reference",
            "link": "/cognitoidentity/latest/APIReference/index.html",
            "description": "Describes the REST API for identity pools."
          },
          {
            "name": "AWS CLI Reference",
            "link": "/cli/latest/reference/cognito-identity/index.html",
            "description": "Describes the AWS CLI commands for identity pools."
          }
        ]
      },
      {
        "name": "Amazon Cognito Sync",
        "items": [
          {
            "name": "Developer Guide",
            "link": "/cognito/latest/developerguide/cognito-sync.html",
            "description": "Provides a conceptual overview of Amazon Cognito Sync and includes instructions that show you how to use its features."
          },
          {
            "name": "API Reference",
            "link": "/cognitosync/latest/APIReference/index.html",
            "description": "Describes the REST API for Amazon Cognito Sync."
          },
          {
            "name": "AWS CLI Reference",
            "link": "/cli/latest/reference/cognito-sync/index.html",
            "description": "Describes the AWS CLI commands for Amazon Cognito Sync."
          }
        ]
      }
    ]
  }
]